project/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-08-20 Thu 10:13 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>PPL &#x2013; Term Project</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">PPL &#x2013; Term Project</h1>
</header><hr >

<div class="abstract">
<p>
Write a simple interpreter for <a href="http://www.muppetlabs.com/~breadbox/bf/"> Brainf**k</a>.
</p>

</div>

<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Requirement</a>
<ul>
<li><a href="#orgheadline3">2.1. Test Program</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
A  Brainf**k program has an implicit byte pointer, called <b>the
pointer</b>, which is free to move around within an array of <b>30000</b>
bytes, initially all set to zero.  The pointer itself is initialized
to point to the beginning of this array.
</p>

<p>
The Brainfuck programming language consists of eight commands, each
of which is represented as a single character.
</p>

<ul class="org-ul">
<li><code>&gt;</code> Increment <i>the pointer</i>.</li>
<li><code>&lt;</code> Decrement <i>the pointer</i>.</li>
<li><code>+</code> Increment the byte at <i>the pointer</i>.</li>
<li><code>-</code> Decrement the byte at <i>the pointer</i>.</li>
<li><code>.</code> A dot, output the byte at <i>the pointer</i>.</li>
<li><code>,</code> A comma, input a byte and store it in the
byte at <i>the pointer</i>.</li>
<li><code>[</code> Jump forward past the matching <code>]</code> IF the byte at <i>the
pointer</i> is zero.</li>
<li><code>]</code> Jump backward to the matching <code>[</code> UNLESS the byte at <i>the
pointer</i> is zero.</li>
</ul>


<p>
For example, one version of the famous "Hello, World!" program in
 Brainf**k is
</p>

<pre class="example">
++++++++++[&gt;+++++++&gt;++++++++++&gt;+++&gt;+&lt;&lt;&lt;&lt;-]&gt;++.&gt;+.+++++++..+++.&gt;++.&lt;&lt;+++++++++++++++.&gt;.+++.------.--------.&gt;+.&gt;.
</pre>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Requirement</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Accepted languages</dt><dd><code>C++</code>, <code>Python</code> and <code>Javascript</code>.  Note that <code>Java</code> is not
an option any more.  Reason?  Sorry but I don't like <code>Java</code>.</dd>
<dt>Deliverable</dt><dd>Put all our source files in a zip file, named
<b><code>your_auburn_username.zip</code></b>, e.g., <code>zzg0009.zip</code>.</dd>
<dt>Submission</dt><dd>Submit on Canvas before deadline.  <i>LATE SUBMISSION IS NOT
ACCEPTED</i>.</dd>
</dl>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.1</span> Test Program</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I will use program to test and grade your code in batch.  So please
double check your function signature.  Failure to run properly may
impact your project grade.  The entry function will all have the
name <code>interprete</code>.  And you may implement as many other helper
functions as you want.  The following sections ellaborate on the
specifications.
</p>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">2.1.1</span> C++</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
I would use C++11 (<code>g++ -std=c++11 ...</code>) to test your program.  So
feel free to employ some of the recent goodies added to C++, e.g.,
lambda function, array initialization, etc.  For convenience,
please separate your declaration and implementation code in <code>bf.h</code>
and <code>bf.cpp</code>.  The function signature is
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #73d216;">std</span>::<span style="color: #fce94f; font-weight: bold;">string</span> <span style="color: #fcaf3e; font-weight: bold;">interprete</span>(<span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #73d216;">std</span>::<span style="color: #fce94f; font-weight: bold;">string</span> &amp;<span style="color: #ff2929;">src</span>, <span style="color: #729fcf; font-weight: bold;">const</span> <span style="color: #73d216;">std</span>::<span style="color: #fce94f; font-weight: bold;">string</span> &amp;<span style="color: #ff2929;">input</span> = <span style="color: #de7fa8;">""</span>);
</pre>
</div>

<p>
My test program would look like
</p>

<div class="org-src-container">

<pre class="src src-C++"><span style="color: #729fcf;">#include</span> <span style="color: #de7fa8;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #de7fa8;">"bf.h"</span>

<span style="color: #fce94f; font-weight: bold;">int</span> <span style="color: #fcaf3e; font-weight: bold;">main</span>()
{
  <span style="color: #73d216;">std</span>::cout &lt;&lt; bf(<span style="color: #de7fa8;">"+."</span>) &lt;&lt; <span style="color: #73d216;">std</span>::endl;      <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">output: 1</span>
  <span style="color: #73d216;">std</span>::cout &lt;&lt; bf(<span style="color: #de7fa8;">",."</span>, <span style="color: #de7fa8;">"2"</span>) &lt;&lt; <span style="color: #73d216;">std</span>::endl; <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">output: 2</span>

  <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.1.2</span> Python</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
I would test your program with Python3.  So please make sure that
you test your program with the correct version of Python.  Please
include all your implementation in <code>bf.py</code>.  The function
signature is
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #fcaf3e; font-weight: bold;">interprete</span>(src, inp=<span style="color: #73d216;">None</span>):
    <span style="color: #729fcf; font-weight: bold;">pass</span>
</pre>
</div>

<p>
The test program would look like
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #729fcf; font-weight: bold;">import</span> bf <span style="color: #729fcf; font-weight: bold;">as</span> bf

<span style="color: #729fcf; font-weight: bold;">print</span>(bf.interprete(<span style="color: #de7fa8;">"+."</span>))      <span style="color: #babdb6; font-style: italic;"># </span><span style="color: #babdb6; font-style: italic;">output: 1</span>
<span style="color: #729fcf; font-weight: bold;">print</span>(bf.interprete(<span style="color: #de7fa8;">",."</span>, <span style="color: #de7fa8;">"2"</span>)) <span style="color: #babdb6; font-style: italic;"># </span><span style="color: #babdb6; font-style: italic;">output: 2</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">2.1.3</span> Javascript</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Please include all your implementation in <code>bf.js</code>.  The function
signature is
</p>

<div class="org-src-container">

<pre class="src src-js">module.exports = {
    <span style="color: #fcaf3e; font-weight: bold;">interprete</span>: <span style="color: #729fcf; font-weight: bold;">function</span>(<span style="color: #ff2929;">src</span>, <span style="color: #ff2929;">inp</span>) {
    }
};
</pre>
</div>

<p>
The test program would look like
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #ff2929;">bf</span> = require(<span style="color: #de7fa8;">"./bf"</span>);

console.log(bf.interprete(<span style="color: #de7fa8;">"+."</span>));      <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">output: 1</span>
console.log(bf.interprete(<span style="color: #de7fa8;">",."</span>, <span style="color: #de7fa8;">"2"</span>)); <span style="color: #babdb6; font-style: italic;">// </span><span style="color: #babdb6; font-style: italic;">output: 2</span>
</pre>
</div>

<hr >
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a class="author"
         href="http://gongzhitaao.org">Zhitao Gong</a> / <span
         class="date">2015-08-20 Thu 10:13</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
